FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/CRM_CLON.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CRM_CLON</Name>
			<Comment>Система записи телефонных разговоров CLON</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерА</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗавершенияЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/DataProcessors/CRM_CLON/Ext/ObjectModule.bsl
#Если Клиент Тогда

Функция ПолучитьЗначениеИзСтроки(Стр,Стр1,Парам)
	Если Парам=1 Тогда
		НомерВхождения = Найти(Стр,"$");
		Если НомерВхождения = 0 Тогда
			Значение = СокрЛП(Стр);
			Стр = "";
		Иначе	
			Значение = Лев(Стр, НомерВхождения);
			Стр = СтрЗаменить(Стр,Значение,"");
			Значение = СокрЛП(СтрЗаменить(Значение,"$",""));
		КонецЕсли;		
	Иначе	
		НомерВхождения = Найти(Стр1,"@");
		Если НомерВхождения = 0 Тогда
			Значение = СокрЛП(Стр1);
			Стр1 = "";
		Иначе	
			Значение = Лев(Стр1, НомерВхождения);
			Стр1 = СтрЗаменить(Стр1,Значение,"");
			Значение = СокрЛП(СтрЗаменить(Значение,"@",""));
		КонецЕсли;
	КонецЕсли;
	Возврат Значение;
КонецФункции 

// Функция найти запись разговоров
//
//Параметры:
//  СтруктураПоискаCLON	 - 
//
// Возвращаемое значение:
//
Функция НайтиЗаписьРазговоров(СтруктураПоискаCLON) Экспорт
	
	ДатаЗвонка = СтруктураПоискаCLON.ДатаЗвонка;
	ВремяНачалаЗвонка = СтруктураПоискаCLON.ВремяНачалаЗвонка;
	ВремяЗавершенияЗвонка = СтруктураПоискаCLON.ВремяЗавершенияЗвонка;
	НомерА = СтруктураПоискаCLON.ТелефонА;
	НомерБ = СтруктураПоискаCLON.ТелефонБ;
	
	
	Дата1 = Лев(Строка(ВремяНачалаЗвонка),10);
	Дата2 = Лев(Строка(ВремяЗавершенияЗвонка),10);
	
	В1Ч=Строка(Час(ВремяНачалаЗвонка));
	Если СтрДлина(В1Ч)=1 Тогда 
		В1Ч = "0"+В1Ч;
	КонецЕсли;	
	В1М=Строка(Минута(ВремяНачалаЗвонка));
	Если СтрДлина(В1М)=1 Тогда 
		В1М = "0"+В1М;
	КонецЕсли;	
	В1С=Строка(Секунда(ВремяНачалаЗвонка));
	Если СтрДлина(В1С)=1 Тогда 
		В1С = "0"+В1С;
	КонецЕсли;	
	Дата1День = День(ВремяНачалаЗвонка);
	Если СтрДлина(Строка(Дата1День))=1 Тогда
		Дата1День = "0"+Строка(Дата1День);
	КонецЕсли;	
	Дата1Месяц =Месяц(ВремяНачалаЗвонка);
	Если СтрДлина(Строка(Дата1Месяц))=1 Тогда
		Дата1Месяц = "0"+Строка(Дата1Месяц);
	КонецЕсли;

	Дата1Год = Сред(Дата1,7,4);
	
	Дата2День = День(ВремяЗавершенияЗвонка);
	Если СтрДлина(Строка(Дата2День))=1 Тогда
		Дата2День = "0"+Строка(Дата2День);
	КонецЕсли;
	Дата2Месяц = Месяц(ВремяЗавершенияЗвонка);
	Если СтрДлина(Строка(Дата2Месяц))=1 Тогда
		Дата2Месяц = "0"+Строка(Дата2Месяц);
	КонецЕсли;
	Дата2Год = Сред(Дата2,7,4);
	
	В2Ч=Строка(Час(ВремяЗавершенияЗвонка));
	Если СтрДлина(В2Ч)=1 Тогда 
		В2Ч = "0"+В2Ч;
	КонецЕсли;	
	В2М=Строка(Минута(ВремяЗавершенияЗвонка));
	Если СтрДлина(В2М)=1 Тогда 
		В2М = "0"+В2М;
	КонецЕсли;	
	В2С=Строка(Секунда(ВремяЗавершенияЗвонка));
	Если СтрДлина(В2С)=1 Тогда 
		В2С = "0"+В2С;
	КонецЕсли;	
    Время1 = В1Ч+":"+В1М+":"+В1С;
	Время2 = В2Ч+":"+В2М+":"+В2С;
	Если Время2 = "00:00:00" Тогда
		Время2 = "23:59:59";
	КонецЕсли;
	ДН=СтрЗаменить(Строка(Дата1Год)," ","")+"."+Строка(Дата1Месяц)+"."+Строка(Дата1День);
	ДК=СтрЗаменить(Строка(Дата2Год)," ","")+"."+Строка(Дата2Месяц)+"."+Строка(Дата2День);
	Если ПустаяСтрока(НомерА) Тогда
		НомерА = "";
	КонецЕсли;
	Если ПустаяСтрока(НомерБ) Тогда
		НомерБ = "";
	КонецЕсли;

	Попытка		
		//ВОТ НОВЫЕ ПАРАМЕТРЫ - НУЖНО ПРОВЕРИТЬ! 
		Стр = сфпObjCLON.SearchRecord("date,time,duration,number_a,number_b,file",ДН,ДК,Время1,Время2,"","","","",НомерА,НомерБ,"",0,"",0,0,0);
		СписокCLON = Новый СписокЗначений;
		Пока НЕ ПустаяСтрока(Стр) Цикл
			С1=ПолучитьЗначениеИзСтроки(Стр,,1);
			СписокCLON.Добавить(с1); 
		КонецЦикла;
	Исключение
		СписокCLON ="";
	КонецПопытки;
	Возврат СписокCLON;
КонецФункции

 #КонецЕсли
